tut/15/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PBiCGStab;
        //preconditioner  DIC;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        relTol          0.01;
    }

    pFinal
    {
        solver          PBiCGStab;
        //solver          PCG;
        //preconditioner  DIC;
        preconditioner  DILU;
        smoother        symGaussSeidel;
        relTol          0;
    }

    "(U|e).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-09;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      3;
    nNonOrthogonalCorrectors 0;
    momentumPredictor    no;

    transonic            yes;
}


// ************************************************************************* //
