tut/15/system/samples
/*--------------------------------*- C++ -*----------------------------------*/

type                sets;
interpolationScheme cellPoint;
setFormat           raw;

writeControl        writeTime;

fields              (Ma);

sets
(
    linex
    {
        type        lineCell;
        axis        x;
        start       (0  0.001 1);
        end         (10 0.001 1);
        nPoints     100;
    }
);


// *********************************************************************** //
