tut/15/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

foamCleanTutorials

tar -xvf constant/polyMesh.tar.xz -C constant/

runApplication rhoPimpleFoam
runApplication postProcess -func samples
./createGraph

#------------------------------------------------------------------------------
